W11D3/BenchBnB/app/controllers/application_controller.rb

    def current_user
        debugger
        @current_user ||= User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "PRW0K3lu3MCrEcC1TVgmiw"], ["LIMIT", 1]]