W8D1/redditapp/app/controllers/posts_controller.rb

    def new
        @subs = Sub.all
---
SELECT "subs".* FROM "subs"