W8D1/redditapp/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "fdsfsdf"], ["description", "wewrwer"], ["user_id", 1], ["created_at", "2020-06-29 19:43:18.748034"], ["updated_at", "2020-06-29 19:43:18.748034"]]
---
    def create
        @sub =  current_user.subs.new(sub_params)
        if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def require_moderator
        @sub = Sub.find(params[:id])

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @user = current_user
        @sub = Sub.find(params[:id])

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def update
        @sub = Sub.find(params[:id])