W11D3/BenchBnB/app/controllers/api/benches_controller.rb

INSERT INTO "benches" ("description", "lat", "lng", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "test"], ["lat", 41.0], ["lng", 75.0], ["created_at", "2020-07-24 19:00:41.377856"], ["updated_at", "2020-07-24 19:00:41.377856"]]
---
    def create
        @bench = Bench.new(bench_params)
        if @bench.save