W8D1/redditapp/app/models/user.rb

UPDATE "users" SET "session_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["session_token", "oyyqEfc/DOnIl8paFtr9Bnqr+nk9tl+lo5xjtjo0YFcO7am4NdOrh1gkS/vj+kBFJMnd4ZAVGbExMMdOTgpVFg=="], ["updated_at", "2020-06-29 18:51:46.756884"], ["id", 1]]
---
    def reset_session_token!
        self.session_token = SecureRandom.base64(64)
        self.save!