W6D3/art_share/app/controllers/artworks_controller.rb

    def index
        if params.has_key?(:user_id)
            artworks = Artwork.where(artist_id: params[:user_id])
        else
            artworks = Artwork.all
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 8]]
SELECT "artworks".* FROM "artworks"

    def update
        artwork = Artwork.find(params[:id])
        if artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1 WHERE "artworks"."id" = $2  [["title", "bettina's drawing"], ["id", 12]]