W6D3/art_share/app/controllers/artwork_shares_controller.rb

    def create
        artwork_share = ArtworkShare.new(artwork_share_params)
        if artwork_share.save!
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 11], ["viewer_id", 27]]