W6D3/art_share/app/controllers/comments_controller.rb

    def index
        if params.has_key?(:artwork_id)
            comment = Comment.where(artwork_id: params[:artwork_id])
        elsif params.has_key?(:user_id)
            comment = Comment.where(user_id: params[:user_id])
        else
            comment = Comment.all
---
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 19]]
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 35]]
SELECT "comments".* FROM "comments"

    def create
        comment = Comment.new(comment_params)
        if comment.save
---
INSERT INTO "comments" ("user_id", "artwork_id", "body") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 37], ["artwork_id", 20], ["body", "Good"]]