W6D3/art_share/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE "users"."user_name" = $1  [["user_name", "Yuan"]]
---
    def index
        users = User.all
        if params.has_key?(:user_name)
            users = User.where("user_name iLIKE ?", "%#{params[:user_name]}%")

INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "Rosemary"], ["email", "rosemary@outlook.com"]]
---
    def create
        user = User.new(user_params)
        # replace the `user_attributes_here` with the actual attribute keys
        if user.save!

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1 WHERE "users"."id" = $2  [["email", "chris@outlook.com"], ["id", 1]]
---
    def update
        user = User.find(params[:id])
        if user.update(user_params)